
message_in_development=👨‍💻⌛ Это функция еще в разработке. Мы добавим её позже, пожалуйста подождите.
message_error_not_edit=❌ Сообщение нельзя изменить.
message_error_not_user_enable=❌ Ошибка: не удалось определить пользователя.

message_before_start=Привет🗿👋!  Это бот🤖 All In One(Всё В Одном)📚. \n💼 Тут будет тест различных функций Aiogram и не только. \n ⛅️ Первая будет погода дальше что-нибудь еще(потом дополню это описание). \n 🚀 ЗАПУСТИТЬ: /start.

message_hello=Привет🗿👋
message_main_menu=!\n💼 Тут будет меню выбора различных функций бота.\n🚑 Так же чтобы вывести все команды бота напиши /help.\n⛅️ Вызвать функцию погоды можно нажав кнопку ниже, либо же введя команду /weather_menu.