
# ? Service Msgs
message_service_in_development =
    👨‍💻⌛ Это функция еще в разработке. Мы добавим её позже, пожалуйста подождите.
message_service_error_not_edit = ❌ Сообщение нельзя изменить.
message_service_error_not_user_enable = ❌ Ошибка: не удалось определить пользователя.
message_service_error_not_found_in_service = ❌ Ошибка: не удалось получить данные от сервиса.


# ? BEFORE Start Msgs
message_before_start =
    Привет🗿👋!  Это бот🤖 All In One(Всё В Одном)📚.
    💼 Тут будет тест различных функций Aiogram и не только.
    ⛅️ Первая будет погода дальше что_нибудь еще(потом дополню это описание).
    🚀 ЗАПУСТИТЬ: /start.


# ? START Msgs
message_start_hello = Привет🗿👋
message_start_main_menu =
    !
    💼 Тут будет меню выбора различных функций бота.
    🚑 Так же чтобы вывести все команды бота напиши /help.
    ⛅️ Вызвать функцию погоды можно нажав кнопку ниже, либо же введя команду /weatherMenu.


# ? Help Msgs
message_help =
    🚑 Это меню помощи.📚 Тут будут все команды бота:
    🚀 Начальное меню /start.
    🚑 Вызвать это меню /help.
    ⛅️ Меню погоды /weatherMenu.


# ? WEATHER Msgs
# ? Weather MENU Msgs
message_weather_menu =
    ⛅️ Это меню погоды. Выбрать нужные функции💼 можно под сообщением или написав нужные команды📚.

# ? Weather NOW Msgs
emoji_weather_now_day = ☀️
emoji_weather_now_night = 🌙
message_weather_now_header =
    🌡 Погода в городе { $city } на { $time }{ $day_or_night_emoji }:

    ☯️ Средняя температура: { $avg_temp }{ $temp_unit }
    ☯️❗ Средняя температура без ошибочных данных: { $avg_filtered }{ $temp_unit }

    ⌛ Сейчас:

message_weather_now_source_template = { $num }. { $source_name }: { $temp }{ $temp_unit }
message_weather_now_summary_template =
    📖 Краткая сводка:
        🏙️ Условия: { $condition }
        👤 Ощущается как: { $feels_like }{ $temp_unit }
        💧 Влажность: { $humidity }{ $humidity_unit }
        🌬️ Ветер: { $wind }{ $wind_unit }


# ? Device Msgs
message_device_select = ❓ Выберете свой девайс для определения местоположения.


# ? LOCATION Msgs

# ? Location COMMON Msgs
message_location_good_send =
    📍 Получено местоположение.
    Ваши координаты и город:
    🏙️ Город: { $city }
    ↔️ Широта: { $latitude }
    ↕️ Долгота: { $longitude }

# ? Location CURRENT Msgs
message_location_current = 📍 Текущая локация:

# ? Location PHONE Msgs
message_location_send_on_phone = ❗ Пожалуйста, отправьте ваше местоположение(через телеграм):

# ? Location PC Msgs
message_location_send_on_pc =
    ❗ Чтобы отменить напишите отмена. Пожалуйста, введите текстом ваше местоположение(Город):

# ? Location ERROR Msgs
message_location_cancel = ❌ Запрос локации отменен.
message_location_null_error =
    ⚠️ В ваших данных локации найдены пустые значения (NULL).
    Пожалуйста, обновите локацию заново:
message_location_save_error = ❌ Ошибка сохранения локации
message_location_not_posted = ❌ Локация не установлена
message_location_unknown_loc = ❓ Неизвестный тип локации
